#+STARTUP: content
#+STARTUP: hideblocks
** description

use youtube-dl to dump the json output of a single video with no-playlist
and pipe into jq and extract the description

#+NAME: description
#+HEADER: :var url="https://www.youtube.com/watch?v=NLINCQeiPGQ"
#+BEGIN_SRC sh :async t :results output raw replace
youtube-dl -j --no-playlist "${url}" \
| jq -rj '"\(.description)\n"'
#+end_src

#+RESULTS: description
Helpless ... alone ... she heard a murder being planned on the telephone!

* [[https://www.youtube.com/channel/UCriRR_CzOny-akXyk1R-oDQ][NapoleonWils0n xmonad playlist]]
#+NAME: Napoleonwils0n-xmonad
#+HEADER: :var url="https://www.youtube.com/playlist?list=PL7hhhG5qUoXmd5_elMnmOQazLaNOnAV9s"
#+BEGIN_SRC sh :async t :results output raw :noweb yes :cache yes :wrap
<<noweb-block>>
#+end_src

#+RESULTS[e157ce336f89f297b2b4a3f03a03f1ca283622d0]: Napoleonwils0n-xmonad
#+begin_results
[[https://youtu.be/oxLMBWTzxe4][xmonad and xmobar set up from scratch]]
[[https://youtu.be/akWJv4t8Cow][xmonad - dwm style window tagging]]
[[https://youtu.be/CptKBPTxcsA][xmonad and rofi as a application launcher and window switcher with icons]]
[[https://youtu.be/zOPCuzVs6bY][xmonad - Firefox Picture in Picture video as a floating window]]
[[https://youtu.be/zOPCuzVs6bY][xmonad - Firefox Picture in Picture video as a floating window]]
[[https://youtu.be/8T10exKhy2c][xmonad - layout hints for correct video size and setting the terminals window title]]
[[https://youtu.be/8T10exKhy2c][xmonad - layout hints for correct video size and setting the terminals window title]]
[[https://youtu.be/lQ5NQy_cUdw][xmonad - emacs scratch pad]]
[[https://youtu.be/oUDFajqhz3U][dmenu show only desktop apps and xmonad WindowBringer dmenu style window switcher]]
[[https://youtu.be/iIPaZb5YmIk][xmonad multiple monitors and desktop notifications, and using the xdg specification]]
[[https://youtu.be/iIPaZb5YmIk][xmonad multiple monitors and desktop notifications, and using the xdg specification]]
[[https://youtu.be/SeqXynnr5_s][Replace xmobar with the tint2 panel to add a system tray for xmonad]]
[[https://youtu.be/SeqXynnr5_s][Replace xmobar with the tint2 panel to add a system tray for xmonad]]
[[https://youtu.be/Z1stHEidohw][Freebsd xmonad-contrib install with cabal]]
#+end_results
